Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-JH_DFP/1.0.80/PIC32CM-JH00/atdf/PIC32CM2532JH00100.atdf
        <module name="NVMCTRL" id="03929" version="1a0">
          <instance name="NVMCTRL">
            <register-group name="NVMCTRL" name-in-module="NVMCTRL" address-space="base" offset="0x41004000"/>
            <signals>
              <signal group="MARGIN" function="default" pad="VMARGIN"/>
            </signals>
            <parameters>
              <param name="ECC_PRESENT" value="1" caption="define out all the added ECC logic - when =0 there shall be no ECC logic present in the design"/>
              <param name="FACTORY_WORD_IMPLEMENTED_MASK" value="0XC0000007FFFFFFFF"/>
              <param name="PMSB" value="3"/>
              <param name="PSZ_BITS" value="6"/>
              <param name="RSTFFLTADDR" value="0x00000000" caption="the reset default for FFLTADDR"/>
              <param name="USER_PAGE_OFFSET" value="0x00800000"/>
              <param name="USER_WORD_IMPLEMENTED_MASK" value="0XC01FFFFFFFFFFFFF"/>
              <param name="DATAFLASH_PAGES" value="128"/>
              <param name="DATAFLASH_ADDR" value="0x00400000" caption="Start address of the Data Flash area"/>
              <param name="DATAFLASH_SIZE" value="8192" caption="Byte size of the Data Flash area"/>
              <param name="FLASH_SIZE" value="262144"/>
              <param name="PAGE_SIZE" value="64"/>
              <param name="PAGES" value="4096"/>
              <param name="PAGES_PR_REGION" value="256"/>
              <param name="INSTANCE_ID" value="34" caption="Instance index for NVMCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="FUSES" id="03929" version="1a0">
          <instance name="FUSES">
            <register-group name="LOCKBIT_FUSES" name-in-module="LOCKBIT_FUSES" address-space="fuses" offset="0x00802000"/>
            <register-group name="OTP1_FUSES" name-in-module="OTP1_FUSES" address-space="fuses" offset="0x00806000"/>
            <register-group name="OTP2_FUSES" name-in-module="OTP2_FUSES" address-space="fuses" offset="0x00806008"/>
            <register-group name="OTP3_FUSES" name-in-module="OTP3_FUSES" address-space="fuses" offset="0x00806010"/>
            <register-group name="OTP4_FUSES" name-in-module="OTP4_FUSES" address-space="fuses" offset="0x00806018"/>
            <register-group name="OTP5_FUSES" name-in-module="OTP5_FUSES" address-space="fuses" offset="0x00806020"/>
            <register-group name="USER_FUSES" name-in-module="USER_FUSES" address-space="fuses" offset="0x00804000"/>
          </instance>
        </module>
        <module name="OSC32KCTRL" id="U2246" version="2.2.0">
          <instance name="OSC32KCTRL">
            <register-group name="OSC32KCTRL" name-in-module="OSC32KCTRL" address-space="base" offset="0x40001400"/>
            <signals>
              <signal group="XIN32" function="XIN32" pad="PA00"/>
              <signal group="XOUT32" function="XOUT32" pad="PA01"/>
            </signals>
            <parameters>
              <param name="OSC32K_COARSE_CALIB_MSB" value="6"/>
              <param name="INSTANCE_ID" value="5" caption="Instance index for OSC32KCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="OSCCTRL" id="U2119" version="2.2.0">
          <instance name="OSCCTRL">
            <register-group name="OSCCTRL" name-in-module="OSCCTRL" address-space="base" offset="0x40001000"/>
            <signals>
              <signal group="XIN" function="XIN" pad="PA14"/>
              <signal group="XOSC_CLK" function="XOSC" pad="PA09"/>
              <signal group="XOSC_EN" function="XOSC" pad="PA08"/>
              <signal group="XOUT" function="XOUT" pad="PA15"/>
            </signals>
            <parameters>
              <param name="GCLK_ID_FDPLL" value="0" caption="Index of Generic Clock for DPLL"/>
              <param name="GCLK_ID_FDPLL32K" value="1" caption="Index of Generic Clock for DPLL 32K"/>
              <param name="FDPLL_VERSION" value="0x220"/>
              <param name="OSC48M_VERSION" value="0x101"/>
              <param name="XOSC_VERSION" value="0x210"/>
              <param name="INSTANCE_ID" value="4" caption="Instance index for OSCCTRL"/>
            </parameters>
          </instance>
        </module>
        <module name="PAC" id="U2120" version="1.1.0">
          <instance name="PAC">
            <register-group name="PAC" name-in-module="PAC" address-space="base" offset="0x40000000"/>
            <parameters>
              <param name="HPB_NUM" value="4" caption="Number of bridges AHB/APB"/>
              <param name="INTFLAG_NUM" value="4" caption="Number of intflag registers"/>
              <param name="INSTANCE_ID" value="0" caption="Instance index for PAC"/>
            </parameters>
          </instance>
        </module>
        <module name="PDEC" id="U2263" version="1.0.0">
          <instance name="PDEC">
            <register-group name="PDEC" name-in-module="PDEC" address-space="base" offset="0x42006800"/>
            <signals>
              <signal group="QDI" index="0" function="J" pad="PA08"/>
              <signal group="QDI" index="0" function="G" pad="PA16"/>
              <signal group="QDI" index="1" function="J" pad="PA09"/>
              <signal group="QDI" index="1" function="G" pad="PA17"/>
              <signal group="QDI" index="2" function="J" pad="PA10"/>
              <signal group="QDI" index="2" function="G" pad="PA18"/>
            </signals>
            <parameters>
              <param name="CC_NUM" value="2" caption="Number of Compare Channels units"/>
              <param name="GCLK_ID" value="41"/>
              <param name="INSTANCE_ID" value="90" caption="Instance index for PDEC"/>
            </parameters>
          </instance>
        </module>
        <module name="PM" id="U2240" version="2.1.1">
          <instance name="PM">
            <register-group name="PM" name-in-module="PM" address-space="base" offset="0x40000400"/>
            <signals>
              <signal group="RESET_N" function="default" pad="RESET_N"/>
            </signals>
            <parameters>
              <param name="BIAS_RAM_HS" value="1" caption="one if RAM HS can be back biased"/>
              <param name="PD_NUM" value="0" caption="Number of switchable Power Domain"/>
              <param name="INSTANCE_ID" value="1" caption="Instance index for PM"/>
            </parameters>
          </instance>
        </module>
        <module name="PORT" id="U2210" version="3.1.0">
          <instance name="PORT">
            <register-group name="PORT" name-in-module="PORT" address-space="base" offset="0x41000000"/>
            <register-group name="PORT_IOBUS" name-in-module="PORT" address-space="base" offset="0x60000000"/>
            <signals>
              <signal group="P" index="0" function="default" pad="PA00"/>
              <signal group="P" index="1" function="default" pad="PA01"/>
              <signal group="P" index="2" function="default" pad="PA02"/>
              <signal group="P" index="3" function="default" pad="PA03"/>
              <signal group="P" index="4" function="default" pad="PA04"/>
              <signal group="P" index="5" function="default" pad="PA05"/>
              <signal group="P" index="6" function="default" pad="PA06"/>
              <signal group="P" index="7" function="default" pad="PA07"/>
              <signal group="P" index="8" function="default" pad="PA08"/>
              <signal group="P" index="9" function="default" pad="PA09"/>
              <signal group="P" index="10" function="default" pad="PA10"/>
              <signal group="P" index="11" function="default" pad="PA11"/>
              <signal group="P" index="12" function="default" pad="PA12"/>
              <signal group="P" index="13" function="default" pad="PA13"/>
              <signal group="P" index="14" function="default" pad="PA14"/>
              <signal group="P" index="15" function="default" pad="PA15"/>
              <signal group="P" index="16" function="default" pad="PA16"/>
              <signal group="P" index="17" function="default" pad="PA17"/>
              <signal group="P" index="18" function="default" pad="PA18"/>
              <signal group="P" index="19" function="default" pad="PA19"/>
              <signal group="P" index="20" function="default" pad="PA20"/>
              <signal group="P" index="21" function="default" pad="PA21"/>
              <signal group="P" index="22" function="default" pad="PA22"/>
              <signal group="P" index="23" function="default" pad="PA23"/>
              <signal group="P" index="24" function="default" pad="PA24"/>
              <signal group="P" index="25" function="default" pad="PA25"/>
              <signal group="P" index="27" function="default" pad="PA27"/>
              <signal group="P" index="28" function="default" pad="PA28"/>
              <signal group="P" index="30" function="default" pad="PA30"/>
              <signal group="P" index="31" function="default" pad="PA31"/>
              <signal group="P" index="32" function="default" pad="PB00"/>
              <signal group="P" index="33" function="default" pad="PB01"/>
              <signal group="P" index="34" function="default" pad="PB02"/>
              <signal group="P" index="35" function="default" pad="PB03"/>
              <signal group="P" index="36" function="default" pad="PB04"/>
              <signal group="P" index="37" function="default" pad="PB05"/>
              <signal group="P" index="38" function="default" pad="PB06"/>
              <signal group="P" index="39" function="default" pad="PB07"/>
              <signal group="P" index="40" function="default" pad="PB08"/>
              <signal group="P" index="41" function="default" pad="PB09"/>
              <signal group="P" index="42" function="default" pad="PB10"/>
              <signal group="P" index="43" function="default" pad="PB11"/>
              <signal group="P" index="44" function="default" pad="PB12"/>
              <signal group="P" index="45" function="default" pad="PB13"/>
              <signal group="P" index="46" function="default" pad="PB14"/>
              <signal group="P" index="47" function="default" pad="PB15"/>
              <signal group="P" index="48" function="default" pad="PB16"/>
              <signal group="P" index="49" function="default" pad="PB17"/>
              <signal group="P" index="50" function="default" pad="PB18"/>
              <signal group="P" index="51" function="default" pad="PB19"/>
              <signal group="P" index="52" function="default" pad="PB20"/>
              <signal group="P" index="53" function="default" pad="PB21"/>
              <signal group="P" index="54" function="default" pad="PB22"/>
              <signal group="P" index="55" function="default" pad="PB23"/>
              <signal group="P" index="56" function="default" pad="PB24"/>
              <signal group="P" index="57" function="default" pad="PB25"/>
              <signal group="P" index="62" function="default" pad="PB30"/>
              <signal group="P" index="63" function="default" pad="PB31"/>
              <signal group="P" index="64" function="default" pad="PC00"/>
              <signal group="P" index="65" function="default" pad="PC01"/>
              <signal group="P" index="66" function="default" pad="PC02"/>
              <signal group="P" index="67" function="default" pad="PC03"/>
              <signal group="P" index="69" function="default" pad="PC05"/>
              <signal group="P" index="70" function="default" pad="PC06"/>
              <signal group="P" index="71" function="default" pad="PC07"/>
              <signal group="P" index="72" function="default" pad="PC08"/>
              <signal group="P" index="73" function="default" pad="PC09"/>
              <signal group="P" index="74" function="default" pad="PC10"/>
              <signal group="P" index="75" function="default" pad="PC11"/>
              <signal group="P" index="76" function="default" pad="PC12"/>
              <signal group="P" index="77" function="default" pad="PC13"/>
              <signal group="P" index="78" function="default" pad="PC14"/>
              <signal group="P" index="79" function="default" pad="PC15"/>
              <signal group="P" index="80" function="default" pad="PC16"/>
              <signal group="P" index="81" function="default" pad="PC17"/>
              <signal group="P" index="82" function="default" pad="PC18"/>
              <signal group="P" index="83" function="default" pad="PC19"/>
              <signal group="P" index="84" function="default" pad="PC20"/>
              <signal group="P" index="85" function="default" pad="PC21"/>
              <signal group="P" index="88" function="default" pad="PC24"/>
              <signal group="P" index="89" function="default" pad="PC25"/>
              <signal group="P" index="90" function="default" pad="PC26"/>
              <signal group="P" index="91" function="default" pad="PC27"/>
              <signal group="P" index="92" function="default" pad="PC28"/>
            </signals>
            <parameters>
              <param name="BITS" value="93"/>
              <param name="DRVSTR" value="1" caption="DRVSTR supported?"/>
              <param name="EV_NUM" value="4"/>
              <param name="GROUPS" value="3"/>
              <param name="MSB" value="92"/>
              <param name="ODRAIN" value="0" caption="ODRAIN supported?"/>
              <param name="SECURE_IMPLEMENTED" value="0" caption="Secure I/Os supported?"/>
              <param name="SLEWLIM" value="0" caption="SLEWLIM supported?"/>
              <param name="INSTANCE_ID" value="32" caption="Instance index for PORT"/>
            </parameters>
          </instance>
        </module>
        <module name="PTC" id="03795" version="7a0">
          <instance name="PTC">
            <register-group name="PTC" name-in-module="PTC" address-space="base" offset="0x42005400"/>
            <signals>
              <signal group="DS" index="0" function="K" pad="PA02"/>
              <signal group="DS" index="1" function="K" pad="PA03"/>
              <signal group="DS" index="2" function="K" pad="PA04"/>
              <signal group="DS" index="3" function="K" pad="PA05"/>
              <signal group="DS" index="4" function="K" pad="PA06"/>
              <signal group="DS" index="5" function="K" pad="PA07"/>
              <signal group="DS" index="6" function="K" pad="PB00"/>
              <signal group="DS" index="7" function="K" pad="PB01"/>
              <signal group="DS" index="8" function="K" pad="PB02"/>
              <signal group="DS" index="9" function="K" pad="PB03"/>
              <signal group="DS" index="10" function="K" pad="PB04"/>
              <signal group="DS" index="11" function="K" pad="PB05"/>
              <signal group="DS" index="12" function="K" pad="PB06"/>
              <signal group="DS" index="13" function="K" pad="PB07"/>
              <signal group="DS" index="14" function="K" pad="PB08"/>
              <signal group="DS" index="15" function="K" pad="PB09"/>
              <signal group="DS" index="16" function="K" pad="PA08"/>
              <signal group="DS" index="17" function="K" pad="PA09"/>
              <signal group="DS" index="18" function="K" pad="PA10"/>
              <signal group="DS" index="19" function="K" pad="PA11"/>
              <signal group="DS" index="20" function="K" pad="PA16"/>
              <signal group="DS" index="21" function="K" pad="PA17"/>
              <signal group="DS" index="22" function="K" pad="PA18"/>
              <signal group="DS" index="23" function="K" pad="PA19"/>
              <signal group="DS" index="24" function="K" pad="PA20"/>
              <signal group="DS" index="25" function="K" pad="PA21"/>
              <signal group="DS" index="26" function="K" pad="PA22"/>
              <signal group="DS" index="27" function="K" pad="PA23"/>
              <signal group="DS" index="28" function="K" pad="PB12"/>
              <signal group="DS" index="29" function="K" pad="PB13"/>
              <signal group="DS" index="30" function="K" pad="PB14"/>
              <signal group="DS" index="31" function="K" pad="PB15"/>
              <signal group="X" index="0" function="B" pad="PA08"/>
              <signal group="X" index="1" function="B" pad="PA09"/>
              <signal group="X" index="2" function="B" pad="PA10"/>
              <signal group="X" index="3" function="B" pad="PA11"/>
              <signal group="X" index="4" function="B" pad="PA16"/>
              <signal group="X" index="5" function="B" pad="PA17"/>
              <signal group="X" index="6" function="B" pad="PA18"/>
              <signal group="X" index="7" function="B" pad="PA19"/>
              <signal group="X" index="8" function="B" pad="PA20"/>
              <signal group="X" index="9" function="B" pad="PA21"/>
              <signal group="X" index="10" function="B" pad="PA22"/>
              <signal group="X" index="11" function="B" pad="PA23"/>
              <signal group="X" index="12" function="B" pad="PB12"/>
              <signal group="X" index="13" function="B" pad="PB13"/>
              <signal group="X" index="14" function="B" pad="PB14"/>
              <signal group="X" index="15" function="B" pad="PB15"/>
              <signal group="Y" index="0" function="B" pad="PA02"/>
              <signal group="Y" index="1" function="B" pad="PA03"/>
              <signal group="Y" index="2" function="B" pad="PA04"/>
              <signal group="Y" index="3" function="B" pad="PA05"/>
              <signal group="Y" index="4" function="B" pad="PA06"/>
              <signal group="Y" index="5" function="B" pad="PA07"/>
              <signal group="Y" index="6" function="B" pad="PB00"/>
              <signal group="Y" index="7" function="B" pad="PB01"/>
              <signal group="Y" index="8" function="B" pad="PB02"/>
              <signal group="Y" index="9" function="B" pad="PB03"/>
              <signal group="Y" index="10" function="B" pad="PB04"/>
              <signal group="Y" index="11" function="B" pad="PB05"/>
              <signal group="Y" index="12" function="B" pad="PB06"/>
              <signal group="Y" index="13" function="B" pad="PB07"/>
              <signal group="Y" index="14" function="B" pad="PB08"/>
              <signal group="Y" index="15" function="B" pad="PB09"/>
              <signal group="Y" index="16" function="B" pad="PA08"/>
              <signal group="Y" index="17" function="B" pad="PA09"/>
              <signal group="Y" index="18" function="B" pad="PA10"/>
              <signal group="Y" index="19" function="B" pad="PA11"/>
              <signal group="Y" index="20" function="B" pad="PA16"/>
              <signal group="Y" index="21" function="B" pad="PA17"/>
              <signal group="Y" index="22" function="B" pad="PA18"/>
              <signal group="Y" index="23" function="B" pad="PA19"/>
              <signal group="Y" index="24" function="B" pad="PA20"/>
              <signal group="Y" index="25" function="B" pad="PA21"/>
              <signal group="Y" index="26" function="B" pad="PA22"/>
              <signal group="Y" index="27" function="B" pad="PA23"/>
              <signal group="Y" index="28" function="B" pad="PB12"/>
              <signal group="Y" index="29" function="B" pad="PB13"/>
              <signal group="Y" index="30" function="B" pad="PB14"/>
              <signal group="Y" index="31" function="B" pad="PB15"/>
            </signals>
            <parameters>
              <param name="DMAC_ID_EOC" value="46" caption="Index of DMA EOC trigger"/>
              <param name="DMAC_ID_SEQ" value="48" caption="Index of DMA SEQ trigger"/>
              <param name="DMAC_ID_WCOMP" value="47" caption="Index of DMA WCOMP trigger"/>
              <param name="DS_LINES_MSB" value="31" caption="Number of DS lines"/>
              <param name="FUSEPRESENT" value="1" caption="Allows the Driven shield to be included or excluded with a fuse"/>
              <param name="GCLK_ID" value="39" caption="Index of Generic Clock"/>
              <param name="XY_LINES_MSB" value="47" caption="The number of x and y lines"/>
              <param name="X_LINES_MSB" value="15" caption="Number of X lines"/>
              <param name="Y_LINES_MSB" value="31" caption="Number of Y lines"/>
              <param name="INSTANCE_ID" value="85" caption="Instance index for PTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RSTC" id="U2239" version="2.0.2">
          <instance name="RSTC">
            <register-group name="RSTC" name-in-module="RSTC" address-space="base" offset="0x40000C00"/>
            <signals>
              <signal group="EXTWAKE" index="0" function="A" pad="PA00"/>
              <signal group="EXTWAKE" index="1" function="A" pad="PA01"/>
              <signal group="EXTWAKE" index="2" function="A" pad="PA02"/>
              <signal group="EXTWAKE" index="3" function="A" pad="PA03"/>
              <signal group="EXTWAKE" index="4" function="A" pad="PA04"/>
              <signal group="EXTWAKE" index="5" function="A" pad="PA05"/>
              <signal group="EXTWAKE" index="6" function="A" pad="PA06"/>
              <signal group="EXTWAKE" index="7" function="A" pad="PA07"/>
              <signal group="EXTWAKE" index="8" function="A" pad="PA08"/>
              <signal group="EXTWAKE" index="9" function="A" pad="PA09"/>
              <signal group="EXTWAKE" index="10" function="A" pad="PA10"/>
              <signal group="EXTWAKE" index="11" function="A" pad="PA11"/>
              <signal group="EXTWAKE" index="12" function="A" pad="PA12"/>
              <signal group="EXTWAKE" index="13" function="A" pad="PA13"/>
              <signal group="EXTWAKE" index="14" function="A" pad="PA14"/>
              <signal group="EXTWAKE" index="15" function="A" pad="PA15"/>
            </signals>
            <parameters>
              <param name="BACKUP_IMPLEMENTED" value="0"/>
              <param name="NUMBER_OF_EXTWAKE" value="0" caption="number of external wakeup line"/>
              <param name="INSTANCE_ID" value="3" caption="Instance index for RSTC"/>
            </parameters>
          </instance>
        </module>
        <module name="RTC" id="03608" version="3a1">
          <instance name="RTC">
            <register-group name="RTC" name-in-module="RTC" address-space="base" offset="0x40002400"/>
            <parameters>
              <param name="DMAC_ID_TIMESTAMP" value="62" caption="DMA RTC timestamp trigger"/>
              <param name="GPR_NUM" value="2" caption="Number of General-Purpose Registers"/>
              <param name="NUM_OF_ALARMS" value="1" caption="Number of Alarms"/>
              <param name="NUM_OF_BKREGS" value="0" caption="Number of Backup Registers"/>
              <param name="NUM_OF_COMP16" value="2" caption="Number of 16-bit Comparators"/>
              <param name="NUM_OF_COMP32" value="1" caption="Number of 32-bit Comparators"/>
              <param name="NUM_OF_TAMPERS" value="1" caption="Number of Tamper Inputs"/>
              <param name="PER_NUM" value="8" caption="Number of Periodic Intervals"/>
              <param name="INSTANCE_ID" value="9" caption="Instance index for RTC"/>
            </parameters>
          </instance>
        </module>
        <module name="SERCOM" id="U2201" version="3.1.1">
          <instance name="SERCOM0">
            <register-group name="SERCOM0" name-in-module="SERCOM" address-space="base" offset="0x42000400"/>
